// ---------------- 1 ----------------------------
arr = ["25255", "4545454", "93493949", "77348384", "8456", "234432", "64419"];

for (let i = 0; i < 7; i++) {
  if (arr[i][0] === "2" || arr[i][0] === "4") {
    console.log(arr[i]);
  }
}

// ----------------- 2 -----------------------------
console.log("------- Простые числа -------");

// функция проверки числа на простое
const isPrime = function (num) {
  // числа меньше 2 не могут быть простыми
  if (num < 2) {
    return false;
  }

  // перебираем делители для числа
  for (let i = 2; i < num; i++) {
    if (num % i === 0) {
      // если делится нацело хотя бы на один из них, возвращаем ложь
      return false;
    }
  }

  return true;
};

for (let i = 1; i <= 100; i++) {
  // выводим в консоль числа, прошедшие проверку на простоту
  if (isPrime(i)) {
    console.log(i);
  }
}
